In my testing, with the following `main.tf`:
```
terraform {
  required_providers {
    sdm = {
      source = "strongdm/sdm"
      version = ">=4.1.0"
    }
  }
}

resource "sdm_resource" "testrsc" {
    amazon_eks_instance_profile {
        name = "test-eks-tf"
        secret_store_id = "se-omitted"
        endpoint = "test"
        cluster_name = "test"
        region = "us-west-2"
    }
}

output "testout" {
  value = sdm_resource.testrsc.id
}
```
I get the following plan and apply output, indicating it is requiring replacement.
```
200sc-M164: local:tftest$ terraform plan
sdm_resource.testrsc: Refreshing state... [id=rs-omitted]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sdm_resource.testrsc must be replaced
-/+ resource "sdm_resource" "testrsc" {
      ~ id = "rs-omitted" -> (known after apply)

      ~ amazon_eks_instance_profile {
          ~ bind_interface        = "127.0.0.1" -> (known after apply)
          - healthcheck_namespace = "default" -> null
            name                  = "test-eks-tf"
          ~ port_override         = 10013 -> (known after apply)
          ~ secret_store_id       = "se-omitted" -> "se-omitted" # forces replacement
          ~ subdomain             = "omitted" -> (known after apply)
          - tags                  = {} -> null
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ testout = "rs-omitted" -> (known after apply)

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
200sc-M164: local:tftest$ terraform apply
sdm_resource.testrsc: Refreshing state... [id=rs-omitted]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sdm_resource.testrsc must be replaced
-/+ resource "sdm_resource" "testrsc" {
      ~ id = "rs-omitted" -> (known after apply)

      ~ amazon_eks_instance_profile {
          ~ bind_interface        = "127.0.0.1" -> (known after apply)
          - healthcheck_namespace = "default" -> null
            name                  = "test-eks-tf"
          ~ port_override         = 10013 -> (known after apply)
          ~ secret_store_id       = "se-omitted" -> "se-omitted" # forces replacement
          ~ subdomain             = "omitted" -> (known after apply)
          - tags                  = {} -> null
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ testout = "rs-omitted" -> (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

sdm_resource.testrsc: Destroying... [id=rs-omitted]
sdm_resource.testrsc: Destruction complete after 0s
sdm_resource.testrsc: Creating...
sdm_resource.testrsc: Creation complete after 0s [id=rs-omitted]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```